---
kind: method
id: M:Autodesk.Revit.DB.SchedulableField.GetCustomFieldData
source: html/abc4328d-5691-043e-60b1-813d430af57b.htm
---
# Autodesk.Revit.DB.SchedulableField.GetCustomFieldData Method

Gets the data associated with this custom field. If this field isn't a CustomField will return Nothing nullptr a null reference ( Nothing in Visual Basic) .

## Syntax (C#)
```csharp
public CustomFieldData GetCustomFieldData()
```

## Returns
Returns the data associated with this custom field. If this field isn't a CustomField will return Nothing nullptr a null reference ( Nothing in Visual Basic) .